content-org/adventuresthreathunting.org
#+hugo_base_dir: ../
#+hugo_section: ./posts/
#+hugo_weight: auto
#+hugo_auto_set_lastmod: t
#+title: Adventures in threathunting
#+seq_todo: DRAFT TODO DONE
#+FILETAGS: :threathunting:
#+TAGS: @personal @forensic @zen @threathunting
#+TAGS: openbsd honeypot zen personal canarytokens skateboarding visibility

* DONE Threat hunting II: SSH Honeypot setup                                            :@threathunting:honeypot:
CLOSED: [2025-09-29 Mo 07:18]
:PROPERTIES:
:EXPORT_AUTHOR: Dirk
:EXPORT_HUGO_FRONT_MATTER_FORMAT: yaml
:EXPORT_OPTIONS: toc:2
:HUGO_TITLE: Threathunting at home
:EXPORT_FILE_NAME: theathuntinghoneypot
:EXPORT_DATE: 2025-05-26T16:21:00-05:00
:CUSTOM_ID: theathuntingathome
:END:
** Introduction
This post provides a brief walkthrough of how to deploy a lightweight,
containerized SSH honeypot using Cowrie and Podman, with the goal of
capturing and analyzing malicious activity as part of my threat hunting
strategy.

** What is Cowrie?
Cowrie is an interactive SSH and Telnet honeypot designed to emulate a
real system, capturing attacker behavior in a controlled environment.
It allows defenders and researchers to observe malicious activity without
exposing actual infrastructure.

_Key capabilities of Cowrie include_

- *Full session logging*: Records all commands entered by the attacker,
  along with input/output streams and timing data. Sessions can be saved
  as plaintext or in formats suitable for replay.

- *Fake file system and shell environment*: Emulates a basic Linux shell
  with a user-modifiable file system. Attackers can navigate directories,
  read/write fake files, or attempt to download/upload payloads.

- *Command emulation*: Supports a large set of common Unix commands (`ls`,
  `cat`, `wget`, etc.), allowing attackers to interact naturally, as
  if on a real system. And can be extended with more commands

- *Credential logging*: Captures usernames and passwords used in
  brute-force login attempts or interactive logins.

- *File download capture*: Logs and optionally stores any files attackers
  attempt to retrieve via `wget`, `curl`, or similar tools.

- *JSON-formatted logging and integration's*: Outputs structured logs that
  are easy to parse and ingest into systems like ELK, Splunk, or custom
  analysis pipelines.

Cowrie is widely used in research, threat intelligence, and proactive defense
efforts to gather Indicators of Compromise (IOCs) and understand attacker
tactics,techniques, and procedures (TTPs).

** Why Podman over Docker?
Podman offers several advantages over Docker, particularly in terms of security
and system integration. It supports rootless containers, allowing users to run
containers without elevated privileges, which reduces the attack surface.  

Podman is daemon-less, integrating more seamlessly with systemd and existing
Linux workflows. Additionally, Podman is fully compatible with the Open
Container Initiative (OCI) standards, ensuring interoperability and
flexibility across container ecosystems.


** Preconditions / System setup
Before I proceed with the cowrie setup, I made sure the following preconditions are met:

*** Ubuntu Installed on Raspberry Pi 4+

I am using a Raspberry Pi 4+ running Ubuntu

*** System Fully Updated

After installation, I made sure system is up to date:

#+begin_src bash
sudo apt update && sudo apt upgrade -y
#+end_src

*** Podman installed and working
#+begin_src sh
# Ubuntu 20.10 and newer
sudo apt-get -y install podman
#+end_src

Run the Hello World Container.In this moment I did not had the cowrie user yet
setup so I used my system user to test

#+begin_src bash
  podman run hello-world
  Trying to pull docker.io/library/hello-world:latest...
  ...
  Hello from Docker!
  This message shows that your installation appears to be working correctly.
#+end_src

tho sometimes the pulling fails like that then I had to put `docker.io` in
front of the container name like:
#+begin_src sh
  podman run docker.io/hello-world  
#+end_src

then it would work for sure.

*** VLAN Tagging Configured on Network Interface

In my network setup for threathunting the honeypot requires VLAN tagging to
configured to reachable from the outside, VLAN210 is my restricted Network.
Therefore i needed to configure the vlan using =nmcli= so it's persistent across reboots.

**** Example: Create a VLAN interface (e.g., VLAN ID 210 on main if)

#+begin_src bash
sudo nmcli con add type vlan con-name vlan210 dev mainif id 210 ip4 192.168.210.3/24 gw4 192.168.210.1
sudo nmcli con up vlan210
#+end_src

- =con-name vlan210=: Name of the new VLAN connection.
- =dev mainif=: Physical interface to tag.
- =id 210=: VLAN ID.
- =ip4=, =gw4=: Optional IP and gateway assignment.

This will persist the configuration and activate the VLAN interface
immediately. Next I moved on to Install the honeypot.

---

** Setup environment, install cowrie as container and adjust configuration
*** 🐧 Create a Dedicated User for Cowrie (No Login Shell)
Running the Podman container under a dedicated system user with no login shell
is a recommended security best practice. Reasons include:

- **Privilege Separation:**  
  Isolates the container from other system processes and users, limiting
  the potential impact of a compromise.

- **Reduced Attack Surface:**  
  The user has no login shell (e.g., =/usr/sbin/nologin=), meaning it can't be
  used to log into the system interactively.

- **Auditing & Logging:**  
  Helps distinguish container activity in system logs and process lists,
  making monitoring easier.

- **Least Privilege Principle:**  
  The user has only the permissions necessary to run the container — nothing more.

**1. Create the 'cowrie' user (no home directory, no login shell)**
#+begin_src sh
sudo useradd --system --no-create-home --shell /usr/sbin/nologin cowrie
#+end_src

**2. Create necessary directories and set ownership**
#+begin_src sh
  sudo mkdir -p /opt/cowrie/etc
  sudo mkdir -p /opt/cowrie/var
  sudo mkdir -p /opt/cowrie/var/log/cowrie
  sudo chown -R cowrie:cowrie /opt/cowrie
#+end_src

*** 🐳 Pull and Configure Cowrie with Podman

**3. As the cowrie user, pull the container image**
#+begin_src bash
sudo -u cowrie podman pull docker.io/cowrie/cowrie
#+end_src

**4. Copy default config file into persistent volume**
#+begin_src bash
sudo -u cowrie podman run --rm localhost/cowrie_honeypot:latest \
  cat /cowrie/cowrie-git/etc/cowrie.cfg.dist > /opt/cowrie/etc/cowrie.cfg
#+end_src


*** 🛠 cowrie.cfg – Basic Overview

The `cowrie.cfg` file is the main configuration for **Cowrie**, the SSH/Telnet
honeypot we use. It uses INI-style syntax and is divided into sections. Each section
begins with a header like *[section_name]*.

