content/posts/theathuntinghoneypot.md
---
title: "Threat hunting II: SSH Honeypot setup"
author: ["Dirk"]
date: 2025-07-13T07:38:00+02:00
lastmod: 2025-07-23T09:43:40+02:00
tags: ["threathunting", "honeypot"]
categories: ["threathunting"]
draft: false
weight: 1002
---

<div class="ox-hugo-toc toc">

<div class="heading">Inhaltsverzeichnis</div>

- [Introduction](#introduction)
- [What is Cowrie?](#what-is-cowrie)
- [Why Podman over Docker?](#why-podman-over-docker)
- [Preconditions / System setup](#preconditions-system-setup)
    - [Ubuntu Installed on Raspberry Pi 4+](#ubuntu-installed-on-raspberry-pi-4-plus)
    - [System Fully Updated](#system-fully-updated)
    - [Podman installed and working:](#podman-installed-and-working)
    - [VLAN Tagging Configured on Network Interface](#vlan-tagging-configured-on-network-interface)
- [Setup environment, install cowrie as container and adjust configuration](#setup-environment-install-cowrie-as-container-and-adjust-configuration)
    - [🐧 Create a Dedicated User for Cowrie (No Login Shell)](#create-a-dedicated-user-for-cowrie--no-login-shell)
    - [🐳 Pull and Configure Cowrie with Podman](#pull-and-configure-cowrie-with-podman)
    - [🛠 cowrie.cfg – Basic Overview](#cowrie-dot-cfg-basic-overview)
    - [🚀 Run Cowrie Container as 'cowrie' User](#run-cowrie-container-as-cowrie-user)
    - [🎯 Operating the Honeypot](#operating-the-honeypot)
    - [🔄 Automatically Restart Cowrie Podman Container with systemd](#automatically-restart-cowrie-podman-container-with-systemd)
    - [🔒 Security Notes](#security-notes)
- [Log Forwarding with Filebeat](#log-forwarding-with-filebeat)
    - [📦 Install Filebeat on Ubuntu](#install-filebeat-on-ubuntu)
    - [⚙ Configure and test Filebeat](#configure-and-test-filebeat)
    - [🚀 Start and Enable Filebeat](#start-and-enable-filebeat)
- [🎯 TL;DR – What Did We Just Do?](#tl-dr-what-did-we-just-do)
- [Whats next](#whats-next)

</div>
<!--endtoc-->


## Introduction {#introduction}

This post provides a brief walkthrough of how to deploy a lightweight,
containerized SSH honeypot using Cowrie and Podman, with the goal of
capturing and analyzing malicious activity as part of my threat hunting
strategy.


## What is Cowrie? {#what-is-cowrie}

Cowrie is an interactive SSH and Telnet honeypot designed to emulate a
real system, capturing attacker behavior in a controlled environment.
It allows defenders and researchers to observe malicious activity without
exposing actual infrastructure.

<span class="underline">Key capabilities of Cowrie include</span>

-   **Full session logging**: Records all commands entered by the attacker,
    along with input/output streams and timing data. Sessions can be saved
    as plaintext or in formats suitable for replay.

-   **Fake file system and shell environment**: Emulates a basic Linux shell
    with a user-modifiable file system. Attackers can navigate directories,
    read/write fake files, or attempt to download/upload payloads.

-   **Command emulation**: Supports a large set of common Unix commands (\`ls\`,
    \`cat\`, \`wget\`, etc.), allowing attackers to interact naturally, as
    if on a real system. And can be extended with more commands

-   **Credential logging**: Captures usernames and passwords used in
    brute-force login attempts or interactive logins.

-   **File download capture**: Logs and optionally stores any files attackers
    attempt to retrieve via \`wget\`, \`curl\`, or similar tools.

-   **JSON-formatted logging and integration's**: Outputs structured logs that
    are easy to parse and ingest into systems like ELK, Splunk, or custom
    analysis pipelines.

Cowrie is widely used in research, threat intelligence, and proactive defense
efforts to gather Indicators of Compromise (IOCs) and understand attacker
tactics,techniques, and procedures (TTPs).


## Why Podman over Docker? {#why-podman-over-docker}

Podman offers several advantages over Docker, particularly in terms of security
and system integration. It supports rootless containers, allowing users to run
containers without elevated privileges, which reduces the attack surface.

Podman is daemon-less, integrating more seamlessly with systemd and existing
Linux workflows. Additionally, Podman is fully compatible with the Open
Container Initiative (OCI) standards, ensuring interoperability and
flexibility across container ecosystems.


## Preconditions / System setup {#preconditions-system-setup}

Before I proceed with the cowrie setup, I made sure the following preconditions are met:


### Ubuntu Installed on Raspberry Pi 4+ {#ubuntu-installed-on-raspberry-pi-4-plus}

I am using a Raspberry Pi 4+ running Ubuntu


### System Fully Updated {#system-fully-updated}

After installation, I made sure system is up to date:

```bash
sudo apt update && sudo apt upgrade -y
```


### Podman installed and working: {#podman-installed-and-working}

```sh
# Ubuntu 20.10 and newer
sudo apt-get -y install podman
```

Run the Hello World Container.In this moment I did not had the cowrie user yet
setup so I used my system user to test

```bash
podman run hello-world
Trying to pull docker.io/library/hello-world:latest...
...
Hello from Docker!
This message shows that your installation appears to be working correctly.
```

tho sometimes the pulling fails like that then I had to put \`docker.io\` in
front of the container name like:

```sh
podman run docker.io/hello-world
```

then it would work for sure.


### VLAN Tagging Configured on Network Interface {#vlan-tagging-configured-on-network-interface}

In my network setup for threathunting the honeypot requires VLAN tagging to
configured to reachable from the outside, VLAN210 is my restricted Network.
Therefore i needed to configure the vlan using `nmcli` so it's persistent across reboots.


#### Example: Create a VLAN interface (e.g., VLAN ID 210 on main if) {#example-create-a-vlan-interface--e-dot-g-dot-vlan-id-210-on-main-if}

```bash
sudo nmcli con add type vlan con-name vlan210 dev mainif id 210 ip4 192.168.210.3/24 gw4 192.168.210.1
sudo nmcli con up vlan210
```

-   `con-name vlan210`: Name of the new VLAN connection.
-   `dev mainif`: Physical interface to tag.
-   `id 210`: VLAN ID.
-   `ip4`, `gw4`: Optional IP and gateway assignment.

This will persist the configuration and activate the VLAN interface
immediately. Next I moved on to Install the honeypot.

---


## Setup environment, install cowrie as container and adjust configuration {#setup-environment-install-cowrie-as-container-and-adjust-configuration}


### 🐧 Create a Dedicated User for Cowrie (No Login Shell) {#create-a-dedicated-user-for-cowrie--no-login-shell}

Running the Podman container under a dedicated system user with no login shell
is a recommended security best practice. Reasons include:

-   ****Privilege Separation:****
    Isolates the container from other system processes and users, limiting
    the potential impact of a compromise.

-   ****Reduced Attack Surface:****
    The user has no login shell (e.g., `/usr/sbin/nologin`), meaning it can't be
    used to log into the system interactively.

-   ****Auditing &amp; Logging:****
    Helps distinguish container activity in system logs and process lists,
    making monitoring easier.

-   ****Least Privilege Principle:****
    The user has only the permissions necessary to run the container — nothing more.

****1. Create the 'cowrie' user (no home directory, no login shell)****

```sh
sudo useradd --system --no-create-home --shell /usr/sbin/nologin cowrie
```

****2. Create necessary directories and set ownership****

```sh
sudo mkdir -p /opt/cowrie/etc
sudo mkdir -p /opt/cowrie/var
sudo chown -R cowrie:cowrie /opt/cowrie
```


### 🐳 Pull and Configure Cowrie with Podman {#pull-and-configure-cowrie-with-podman}

****3. As the cowrie user, pull the container image****

```bash
sudo -u cowrie podman pull docker.io/cowrie/cowrie
```

****4. Copy default config file into persistent volume****

```bash
sudo -u cowrie podman run --rm cowrie/cowrie \
  cat /cowrie/cowrie-git/etc/cowrie.cfg.dist > /opt/cowrie/etc/cowrie.cfg
```


### 🛠 cowrie.cfg – Basic Overview {#cowrie-dot-cfg-basic-overview}

The \`cowrie.cfg\` file is the main configuration for ****Cowrie****, the SSH/Telnet
honeypot we use. It uses INI-style syntax and is divided into sections. Each section
begins with a header like **[section_name]**.

<!--list-separator-->

-  📁 Key Sections &amp; Settings

    ****[ssh] / [telnet]****
