content-org/adventuresthreathunting.org
***** 📁 Key Sections & Settings
**[ssh]**
- Enable or disable SSH/Telnet and set the port to listen on::
  #+begin_src sh
  enabled = true
  listen_port = 2222
  #+end_src

**[honeypot]**
- Set honeypot host name and logpath properties:
  #+begin_src sh
    hostname = cowrie-host
 
    # Directory where to save log files in.
    log_path = var/log/cowrie
  #+end_src

- Define login behavior:
  #+begin_src sh
  auth_class = AuthRandom
  auth_class_parameters = 1, 5, 10
  #+end_src

  I use AuthRandom here which causes to allow access after "randint(2,5)"
  attempts. This means the threat actor will fail with some logins and some
  will be logged in immediately. 

**[output_jsonlog]**
- Configure logging and output plugins:
  #+begin_src sh
  [output_jsonlog]
  enabled = true
  logfile = ${honeypot:log_path}/cowrie.json
  epoch_timestamp = false
  #+end_src
  This sets the default log location in the file-system, this is important so that file beat later can
  pickup on the juicy honeypot log files.

This is the whole configuration needed to run the honeypot.

_📌 Notes_
- Restart Cowrie after configuration changes.
- The configuration can be split across multiple `.cfg` files in `cowrie.cfg.d/` for modular setup.

*** 🚀 Run Cowrie Container as 'cowrie' User

Once I had created the dedicated system user (see earlier section), I
was able to run the Cowrie container with Podman using =sudo -u= and UID mapping.

**** Step-by-Step Command explanation

#+begin_src bash
sudo -u cowrie podman run -d --name cowrie \
  --uidmap 0:999:1001 \
  -v /opt/cowrie/etc:/cowrie/cowrie-git/etc:Z \
  -v /opt/cowrie/var:/cowrie/cowrie-git/var:Z \
  -p 2222:2222 \
  cowrie/cowrie
#+end_src

**** Explanation

- =sudo -u cowrie=: Runs the Podman command as the unprivileged =cowrie= user.
- =--uidmap 0:999:1001=: Maps root (UID 0) **inside** the container to the =cowrie= UID on the host.
- =-v /opt/cowrie/etc= and =/opt/cowrie/var=: Mounts configuration and data volumes from the host with `:Z` to apply correct SELinux labels (optional on systems without SELinux).
- =-p 2222:2222=: Forwards port 2222 from host to container (Cowrie's SSH honeypot port).
- =cowrie/cowrie=: The container image name (use latest or specific tag as needed).
  
**** Benefits:

- **Container runs as non-root on the host:**  
  Even if a process inside the container thinks it's root, it's actually limited to the unprivileged =cowrie= user outside the container.

- **Enhanced security:**  
  If the container is compromised, the attacker only gets access as the =cowrie= user — not real root.

- **Avoids root-equivalent risks:**  
  Prevents privilege escalation or access to sensitive host files and devices.
  
*** 🎯 Operating the Honeypot

- **View logs**
  I think to know how to debug the container is important so we start first
  with the logs: 

  #+begin_src sh
    sudo -u cowrie podman logs -f cowrie
    ...snip...
    [HoneyPotSSHTransport,14,10.0.2.100] Closing TTY Log: var/lib/cowrie/tty/e52d9c508c502347344d8c07ad91cbd6068afc75ff6292f062a09ca381c89e71 after 0.8 seconds
    [cowrie.ssh.connection.CowrieSSHConnection#info] sending close 0
    [cowrie.ssh.session.HoneyPotSSHSession#info] remote close
    [HoneyPotSSHTransport,14,10.0.2.100] Got remote error, code 11 reason: b'disconnected by user'
    [HoneyPotSSHTransport,14,10.0.2.100] avatar root logging out
    [cowrie.ssh.transport.HoneyPotSSHTransport#info] connection lost
    [HoneyPotSSHTransport,14,10.0.2.100] Connection lost after 2.8 seconds
    ...snip...
  #+end_src

- **Restart container**
  If things go left just restart that thing: 
  #+begin_src bash
  sudo -u cowrie podman restart cowrie
  #+end_src

  In the logs you can see that cowrie is running and accepting SSH connections:
  #+begin_src sh
    ...snip...
    [-] CowrieSSHFactory starting on 2222
    [cowrie.ssh.factory.CowrieSSHFactory#info] Starting factory <cowrie.ssh.factory.CowrieSSHFactory object at 0x7fb66f26d0>
    [-] Ready to accept SSH connections
    ...snip...
  #+end_src
  When the log says "Ready to accept SSH connections" I tested if I could login:

  #+begin_src sh
    ssh 192.168.210.3 -p 2222 -l root
    root@192.168.210.3 password: 

    The programs included with the Debian GNU/Linux system are free software;
    the exact distribution terms for each program are described in the
    individual files in /usr/share/doc/*/copyright.

    Debian GNU/Linux comes with ABSOLUTELY NO WARRANTY, to the extent
    permitted by applicable law.
    root@svr04:~# uname -a
    Linux svr04 3.2.0-4-amd64 #1 SMP Debian 3.2.68-1+deb7u1 x86_64 GNU/Linux
    root@svr04:~#
  #+end_src

- **Stop container**
  Nothing special here:
  #+begin_src bash
    sudo -u cowrie podman stop cowrie
  #+end_src
---
*** 🔄 Automatically Restart Cowrie Podman Container with systemd

To keep your Cowrie container running reliably and restart it if it stops, use a systemd service with restart policies.
Please make sure to double check this part on your side as I am no systemd
expert at all, for me this just worked.

**** Step 1: Generate a systemd Service File

Create `/etc/systemd/system/cowrie-container.service` with the following
content:
You can create the systemd file with the command:
#+begin_src sh
sudo -u cowrie podman generate systemd --name cowrie --files --restart-policy=on-failure  
#+END_SRC

The resulting file looks somewhat like this
#+begin_src sh
  # container-cowrie.service
  # autogenerated by Podman 4.3.1
  # Fri Sep 19 10:27:47 CEST 2025

  [Unit]
  Description=Podman container-cowrie.service
  Documentation=man:podman-generate-systemd(1)
  Wants=network-online.target
  After=network-online.target
  RequiresMountsFor=/run/user/1001/containers

  [Service]
  User=cowrie
  Group=cowrie
  Restart=on-failure
  Environment=PODMAN_SYSTEMD_UNIT=%n
  Restart=on-failure
  TimeoutStopSec=70
  ExecStart=/usr/bin/podman start -a cowrie
  ExecStop=/usr/bin/podman stop -t 10 cowrie
  ExecStopPost=/usr/bin/podman stop -t 10 cowrie
  Type=forking

  [Install]
  WantedBy=default.target
#+end_src

- The `--restart-policy=on-failure` makes systemd restart the container if it exits with a failure.

**** Step 2: Enable the Service
#+begin_src bash
  sudo systemctl daemon-reload
  sudo systemctl enable --now cowrie-container.service
#+end_src

**** Step 3: (Optional) Add a Health Check Script

To detect if Cowrie stops accepting connections even if the container is still running, create a health check script running as =cowrie=:

Create `/usr/local/bin/check_cowrie.sh`:

#+begin_src bash
  #!/bin/bash
  if ! nc -z localhost 2222; then
    echo "Cowrie not responding, restarting container"
    /usr/bin/podman restart cowrie
    /usr/local/bin/pushover.sh "Cowrie was restarted!"
  fi
#+end_src

This restarts the service and sends out a notification via pushover.

Make it executable:

#+begin_src bash
sudo chmod +x /usr/local/bin/check_cowrie.sh
sudo chown cowrie:cowrie /usr/local/bin/check_cowrie.sh
#+end_src

Create systemd service `/etc/systemd/system/check_cowrie.service`:

#+begin_src ini
[Unit]
Description=Check Cowrie honeypot health

[Service]
User=cowrie
Group=cowrie
Type=oneshot
ExecStart=/usr/local/bin/check_cowrie.sh
#+end_src

Create systemd timer `/etc/systemd/system/check_cowrie.timer`:

#+begin_src ini
[Unit]
Description=Run Cowrie health check every minute

[Timer]
OnBootSec=1min
OnUnitActiveSec=1min
Unit=check_cowrie.service

[Install]
WantedBy=timers.target
#+end_src

Enable and start the timer:

#+begin_src bash
sudo systemctl daemon-reload
sudo systemctl enable --now check_cowrie.timer
#+end_src

---

**** Summary

- Used Podman’s systemd integration for automatic restart on container failure.
- Added a health check timer to detect if Cowrie stops accepting connections and restart proactively.

