content-org/adventuresthreathunting.org
*** 🔒 Security Notes
- The `cowrie` user has no login shell (`/usr/sbin/no login`)
- Running Cowrie isolated via Podman increases containment
- All files are owned by `cowrie`, no root access required for normal operation

  ---

** Log Forwarding with Filebeat
*** 📦 Install Filebeat on Ubuntu

**1. Add Elastic’s GPG key and repository**
#+begin_src bash
curl -fsSL https://artifacts.elastic.co/GPG-KEY-elasticsearch | sudo gpg --dearmor -o /usr/share/keyrings/elastic.gpg

echo "deb [signed-by=/usr/share/keyrings/elastic.gpg] https://artifacts.elastic.co/packages/8.x/apt stable main" | \
  sudo tee /etc/apt/sources.list.d/elastic-8.x.list
#+end_src

**2. Update APT and install Filebeat**
#+begin_src bash
sudo apt install filebeat
#+end_src

*** ⚙ Configure and test Filebeat

**3. Edit Filebeat config**
#+begin_src bash
sudo mg /etc/filebeat/filebeat.yml
#+end_src
The filebeat config is straight forward. You have to write a filebeat.input
block which contains the path where the logfiles are you need to ingest. And
at the end the log-destination (logstash) so that filebeat knows where to send
the logs to: 
#+begin_src yaml
  filebeat.inputs:
  - type: log
    enabled: true
    paths:
      - /opt/cowrie/var/log/cowrie/cowrie.json
    json.keys_under_root: true
    json.add_error_key: true
    fields:
      source: cowrie
    fields_under_root: true

  output.logstash:
    hosts: ["192.168.123.5:5044"]
#+end_src

**4. (Optional) Test Filebeat config**
#+begin_src bash
  sudo filebeat test config
  logstash: 192.168.210.5:5044...
  connection...
    parse host... OK
    dns lookup... OK
    addresses: 192.168.210.5
    dial up... OK
  TLS... WARN secure connection disabled
  talk to server... OK
#+end_src

*** 🚀 Start and Enable Filebeat

**5. Enable and start Filebeat**
#+begin_src bash
  sudo systemctl enable filebeat
  sudo systemctl daemon-reload
  sudo systemctl start filebeat
#+end_src

**6. Check Filebeat status and logs**
#+begin_src bash
sudo systemctl status filebeat
sudo journalctl -u filebeat -f
#+end_src
---
** 🎯 TL;DR – What Did We Just Do?

**1. We deployed Cowrie like pros.**
- Ran it safely in a Podman container under a non-login user.
- No mess, no root, no regrets.

**2. Logs? Sorted.**
- Filebeat scooped up Cowrie’s logs and shipped them to Elasticsearch.
- Now we can actually *see* who's knocking on the honeypot door.

**3. Everything’s persistent.**
- Configs and logs live outside the container. Cowrie forgets nothing—even after a reboot.

**4. Setup is clean and modular.**
- Each part (Cowrie, Filebeat, Elasticsearch) does its job. 
- Break one, fix one—no domino disasters.

**5. It’s nerdy, useful, and kinda fun.**
- Now I built a mini threat intel system.
- Now I can sit back, sip coffee, and watch the kiddies play.

** Whats next
Next I build the [[~/../honeyhttpd][HTTP Honeypot]]

#+BEGIN_EXPORT md
{{< giscus >}}
#+END_EXPORT


