content/posts/theathuntinghoneypot.md


### 🔒 Security Notes {#security-notes}

-   The \`cowrie\` user has no login shell (\`/usr/sbin/no login\`)
-   Running Cowrie isolated via Podman increases containment
-   All files are owned by \`cowrie\`, no root access required for normal operation

    ---


## Log Forwarding with Filebeat {#log-forwarding-with-filebeat}


### 📦 Install Filebeat on Ubuntu {#install-filebeat-on-ubuntu}

****1. Add Elastic’s GPG key and repository****

```bash
curl -fsSL https://artifacts.elastic.co/GPG-KEY-elasticsearch | sudo gpg --dearmor -o /usr/share/keyrings/elastic.gpg

echo "deb [signed-by=/usr/share/keyrings/elastic.gpg] https://artifacts.elastic.co/packages/8.x/apt stable main" | \
  sudo tee /etc/apt/sources.list.d/elastic-8.x.list
```

****2. Update APT and install Filebeat****

```bash
sudo apt update
sudo apt install filebeat
```


### ⚙ Configure and test Filebeat {#configure-and-test-filebeat}

****3. Edit Filebeat config****

```bash
sudo mg /etc/filebeat/filebeat.yml
```

The filebeat config is straight forward. You have to write a filebeat.input
block which contains the path where the logfiles are you need to ingest. And
at the end the log-destination (logstash) so that filebeat knows where to send
the logs to:

```yaml
filebeat.inputs:
- type: log
  enabled: true
  paths:
    - /opt/cowrie/var/log/cowrie/cowrie.json
  json.keys_under_root: true
  json.add_error_key: true
  fields:
    source: cowrie
  fields_under_root: true

output.logstash:
  hosts: ["192.168.123.5:5044"]
```

****4. (Optional) Test Filebeat config****

```bash
sudo filebeat test config
```


### 🚀 Start and Enable Filebeat {#start-and-enable-filebeat}

****5. Enable and start Filebeat****

```bash
sudo systemctl enable filebeat
sudo systemctl daemon-reload
sudo systemctl start filebeat
```

****6. Check Filebeat status and logs****

```bash
sudo systemctl status filebeat
sudo journalctl -u filebeat -f
```

---


## 🎯 TL;DR – What Did We Just Do? {#tl-dr-what-did-we-just-do}

****1. We deployed Cowrie like pros.****

-   Ran it safely in a Podman container under a non-login user.
-   No mess, no root, no regrets.

****2. Logs? Sorted.****

-   Filebeat scooped up Cowrie’s logs and shipped them to Elasticsearch.
-   Now we can actually **see** who's knocking on the honeypot door.

****3. Everything’s persistent.****

-   Configs and logs live outside the container. Cowrie forgets nothing—even after a reboot.

****4. Setup is clean and modular.****

-   Each part (Cowrie, Filebeat, Elasticsearch) does its job.
-   Break one, fix one—no domino disasters.

****5. It’s nerdy, useful, and kinda fun.****

-   Now I built a mini threat intel system.
-   Now I can sit back, sip coffee, and watch the kiddies play.


## Whats next {#whats-next}

Next I had to build the HTTP honeypot, stay tuned for the follow up!

## Feedback and Comments
{{< giscus >}}
